tap "caskformula/caskformula"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# A modern replacement for ‘ls’.
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Perform tasks asynchronously without external tools
brew "zsh-async"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Enable Windows-like alt-tab
cask "alt-tab"
# Web browser
cask "firefox-developer-edition"
# Clipboard manager for developers
cask "flycut"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome-dev"
# Tools to protect your emails and files
cask "gpg-suite"
# Menu bar calendar
cask "itsycal"
# Password manager app
cask "keepassxc"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Control your tools with a few keystrokes
cask "raycast"
# System monitor for the menu bar
cask "stats"
